# ✅ app/utils/stopwords.py

DEFAULT_STOPWORDS = [
    "관련", "있습니다", "있다", "위해", "통해", "이후", "대한", "하지만", "하는", "했다", "되어", "보다", "이런", "이렇게",
    "있으며", "한다", "되고", "가지고", "까지", "또는", "그리고", "입니다", "하면", "한다면", "되었다", "하는데",
    "것", "수", "등", "및", "더", "또", "중", "가장", "때문에", "이번", "이전", "최근", "현재", "지난", "다시",
    "앞으로", "등을", "등의", "대한", "에서", "으로", "이나", "보다", "된다", "되지", "되어", "있는", "있어",
    "하고", "하며", "하면서", "까지", "으로써", "그", "이", "저", "것을", "그것", "저것", "등등", "무엇", "왜", "어디",
    "누구", "어떻게", "언제", "나", "우리", "여러", "많은", "적", "다른", "모든", "같은", "등이", "중에", "부터", "라도",
    "조차", "조금", "때", "안", "밖에", "또한", "일부", "전체", "계속", "이미", "현재", "이번", "모두", "자신", "대해",
    "그런", "또는", "특히", "그리고", "그러나", "반면", "때문", "이유로", "하지만", "따라", "그러나", "동안", "만에", "만큼",
    "있다는", "등으로", "이라고", "중이다", "휘둘러", "예정이다", "널리", "대해서도", "말했다", "것으로", "따르면", "운영한다",
    "그", "기사", "온", "오른", "거", "우리", "아마", "의", "지난해", "수준", "로부터", "막상", "결과", "개",  "다음", "세운",
    "각각", "경우", "제공", "하스", "자체", "유치", "기반", "점", "전", "것", "최" ,"전", "연속", "찌", "리", "씨", "주요", "르",
    "잠시", "네", "올해", "원", "로", "조", "팀", "다해" ,"를", "을", "대비", "평균", "확인", "향후", "직전", "목표가인", "그동안",
    "고", "내년", "전망", "당분간","유지", "면서", "출신", "정말", "기존", "오늘", "마무리", "대신", "크게", "오후", "저녁", "기존"
]

STOPWORD_PREFIXES = [
	"", "로","을", "를", "이", "가", "은", "는", "에", "의", "로", "과", "와", "도", "으로", "에서", "부터", "까지",
    "막상", "정말", "사실", "솔직히", "그리고", "결국", "아무튼", "또한", "잠시", "네", "올해", "곧잘", "향후",
    "주중", "전용", "대비", "면서"
]